mysql/location/log/20260818.124835.name.0008.txt
sysbench 1.1.1-94740b0 (using system LuaJIT 2.1.1767980792)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Preparing queriesPreparing queries

Preparing queries
Preparing queries
Preparing queries
[...]
Threads started!

[ 1s ] thds: 8 tps: 140.15 qps: 288.26 (r/w/o: 288.26/0.00/0.00) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 149.89 qps: 299.77 (r/w/o: 299.77/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 140.22 qps: 280.43 (r/w/o: 280.43/0.00/0.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 150.46 qps: 300.92 (r/w/o: 300.92/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 149.98 qps: 299.96 (r/w/o: 299.96/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 147.95 qps: 295.91 (r/w/o: 295.91/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 150.10 qps: 300.21 (r/w/o: 300.21/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 147.98 qps: 295.97 (r/w/o: 295.97/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 149.23 qps: 298.46 (r/w/o: 298.46/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 152.28 qps: 303.57 (r/w/o: 303.57/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 146.52 qps: 294.05 (r/w/o: 294.05/0.00/0.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 148.27 qps: 296.54 (r/w/o: 296.54/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 140.28 qps: 280.56 (r/w/o: 280.56/0.00/0.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 147.22 qps: 294.43 (r/w/o: 294.43/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 151.18 qps: 302.37 (r/w/o: 302.37/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 148.73 qps: 297.46 (r/w/o: 297.46/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 149.87 qps: 299.73 (r/w/o: 299.73/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 140.08 qps: 280.16 (r/w/o: 280.16/0.00/0.00) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 146.72 qps: 293.44 (r/w/o: 293.44/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 142.96 qps: 285.93 (r/w/o: 285.93/0.00/0.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 147.04 qps: 294.08 (r/w/o: 294.08/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 147.36 qps: 293.72 (r/w/o: 293.72/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 147.89 qps: 296.79 (r/w/o: 296.79/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 150.42 qps: 300.84 (r/w/o: 300.84/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 149.42 qps: 298.83 (r/w/o: 298.83/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 152.09 qps: 304.18 (r/w/o: 304.18/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 146.82 qps: 293.63 (r/w/o: 293.63/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 148.94 qps: 297.88 (r/w/o: 297.88/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 149.21 qps: 298.42 (r/w/o: 298.42/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 148.97 qps: 297.94 (r/w/o: 297.94/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 148.90 qps: 296.79 (r/w/o: 296.79/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 150.62 qps: 301.23 (r/w/o: 301.23/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 144.55 qps: 290.09 (r/w/o: 290.09/0.00/0.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 147.93 qps: 295.86 (r/w/o: 295.86/0.00/0.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 147.08 qps: 294.16 (r/w/o: 294.16/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 148.12 qps: 296.24 (r/w/o: 296.24/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 143.41 qps: 286.82 (r/w/o: 286.82/0.00/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 107.00 qps: 213.99 (r/w/o: 213.99/0.00/0.00) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 143.80 qps: 287.60 (r/w/o: 287.60/0.00/0.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 135.95 qps: 271.90 (r/w/o: 271.90/0.00/0.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 146.27 qps: 292.53 (r/w/o: 292.53/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 146.26 qps: 292.52 (r/w/o: 292.52/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 147.18 qps: 294.35 (r/w/o: 294.35/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 146.09 qps: 292.18 (r/w/o: 292.18/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 134.86 qps: 269.72 (r/w/o: 269.72/0.00/0.00) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 147.19 qps: 294.38 (r/w/o: 294.38/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 147.78 qps: 295.56 (r/w/o: 295.56/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 146.85 qps: 293.70 (r/w/o: 293.70/0.00/0.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 146.12 qps: 292.24 (r/w/o: 292.24/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 148.61 qps: 297.23 (r/w/o: 297.23/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 147.45 qps: 293.91 (r/w/o: 293.91/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 147.94 qps: 296.89 (r/w/o: 296.89/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 146.17 qps: 292.34 (r/w/o: 292.34/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 142.33 qps: 284.66 (r/w/o: 284.66/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 139.58 qps: 279.17 (r/w/o: 279.17/0.00/0.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 146.07 qps: 292.15 (r/w/o: 292.15/0.00/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 146.08 qps: 292.15 (r/w/o: 292.15/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 146.40 qps: 292.81 (r/w/o: 292.81/0.00/0.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 145.36 qps: 290.72 (r/w/o: 290.72/0.00/0.00) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 146.14 qps: 292.27 (r/w/o: 292.27/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      36.894 |                                         2
      37.565 |                                         5
      38.247 |*                                        12
      38.942 |*                                        8
      39.650 |**                                       21
      40.370 |***                                      34
      41.104 |***                                      39
      41.851 |***                                      39
      42.611 |*****                                    71
      43.385 |********                                 108
      44.173 |**********                               136
      44.976 |***********                              145
      45.793 |*****************                        223
      46.625 |****************                         216
      47.472 |*********************                    270
      48.335 |*************************                334
      49.213 |*******************************          404
      50.107 |**********************************       443
      51.018 |**************************************** 518
      51.945 |**************************************** 524
      52.889 |**************************************** 521
      53.850 |**************************************   499
      54.828 |***************************************  514
      55.824 |*************************************    487
      56.839 |***********************************      462
      57.871 |***********************************      453
      58.923 |******************************           394
      59.993 |*****************************            386
      61.083 |**********************                   289
      62.193 |*********************                    275
      63.323 |****************                         210
      64.474 |************                             154
      65.645 |*********                                118
      66.838 |******                                   82
      68.053 |******                                   74
      69.289 |****                                     55
      70.548 |****                                     52
      71.830 |**                                       23
      73.135 |*                                        19
      74.464 |*                                        12
      75.817 |*                                        15
      77.194 |*                                        15
      78.597 |*                                        10
      80.025 |*                                        12
      81.479 |*                                        7
      82.959 |                                         5
      84.467 |                                         5
      86.002 |                                         2
      87.564 |                                         3
      89.155 |                                         6
      90.775 |                                         6
      94.104 |                                         1
      95.814 |                                         2
      97.555 |                                         4
      99.327 |                                         3
     101.132 |                                         2
     102.969 |                                         3
     104.840 |                                         5
     106.745 |                                         3
     108.685 |                                         4
     110.659 |                                         2
     112.670 |                                         3
     114.717 |                                         1
     116.802 |                                         3
     118.924 |                                         6
     121.085 |                                         3
     125.525 |                                         1
     127.805 |                                         1
     134.899 |                                         1
 
SQL statistics:
    queries performed:
        read:                            17530
        write:                           0
        other:                           0
        total:                           17530
    transactions:                        8765   (145.99 per sec.)
    queries:                             17530  (291.99 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      145.9929
    time elapsed:                        60.0372s
    total number of events:              8765

Latency (ms):
         min:                                  37.042
         avg:                                  54.783
         max:                                 134.935
         95th percentile:                      66.838
         sum:                              480172.839

Threads fairness:
    events (avg/stddev):           1095.6250/11.62
    execution time (avg/stddev):   60.0216/0.01